{
    "order": 3,
    "title": "SPUME & SPINDRIFT PART II",
    "time": "friday",
    "description": "(TRT: 63 min)",
    "pieces": [
        {
            "artist": "Tomonari Nishikawa ",
            "title": "457 Broadway",
            "videoinfo": "Vestal, NY | 5 min | 16mm | sound",
            "homepage": "http://www.tomonarinishikawa.com",
            "description": "My works would show my interest inmedia, formats, and filmmaking techniques that I choose to express particular ideas found at an event/phenomenon in public space.  (TN)",
            "image": "http://dinca.org/wp-content/uploads/2013/11/Tomonari-Nishikawa-457-Broadway.jpg"
        },
        {
            "artist": "Zahid Jiwa",
            "title": "Oasis of Mirrors",
            "videoinfo": "Brazzaville, Congo | 2013 | 3 min | video | color | sound",
            "homepage": "http://newknowledge.info",
            "description": "The ebb and flow of the aeolian processes' spatial structure under this single shot of inspired manipulation is as natural and inevitable as breathing, unforced, rhythmic and healthy.  (ZJ)",
            "image": "http://dinca.org/wp-content/uploads/2013/11/Zahid-Jiwa-Oasis-of-Mirrors.png"
        },
        {
            "artist": "Leslie Thornton",
            "title": "Binocular Series: Zebra 2",
            "videoinfo": "NYC, NY | 2013 | 3 min | color | sound",
            "homepage": "http://www.winkleman.com/exhibitions/766",
            "image": "http://dinca.org/wp-content/uploads/2013/11/Leslie-Thornton-Binocular-Series-Zebra.png",
            "description": "A cinematic duad between a zebra and a kaleidoscopic filter. (AR)"
        },
        {
            "artist": "Sabrina Ratté",
            "image": "http://dinca.org/wp-content/uploads/2013/11/Sabrina-Ratté-The-Land-Behind.jpg",
            "title": "The Land Behind",
            "videoinfo": "Montreal, Canada | 2013 | 5 min | video | sound",
            "homepage": "http://sabrinaratte.com",
            "description": "Traveling on an undefined territory where the illusion of a continuous tracking shot emphasizes an unreachable destination. Through the syncopated editing and multiple transitions, images of the area themselves become traveling entities, creating confusion on the level of the depicted space as much as with the level of its temporality. Music / Roger Tellier-Craig. Video+sound editing / Sabrina Ratté  (SR)"
        },
        {
            "artist": "Trisha Baga",
            "image": "http://dinca.org/wp-content/uploads/2013/11/Trisha-Baga-Peacock.jpg",
            "title": "Peacock",
            "videoinfo": "NYC, NY | 2011 | 13 min | video | sound",
            "description": "A mixture of found and authored, analogue and digital footage spins an intriguingly fragmented narrative of exploration and discovery. (open file.org.uk)",
            "homepage": "http://vimeo.com/user2750369"
        },
        {
            "artist": "Kerry Laitala",
            "image": "http://dinca.org/wp-content/uploads/2013/11/Kerry-Laitala-Chromatic-Frenzy.jpg",
            "title": "Chromatic Frenzy",
            "videoinfo": "San Francisco, CA | 2009 | 8 min | 16mm on video | silent",
            "homepage": "http://kerrylaitala.net",
            "description": "Shot in the filmmaker’s studio, frantic colored lights permeate the atmosphere. Vibrating swathes of color, penetrate the darkness; searchlight spectrums of suspended crystalline forms inspired by the likes of Wolfgang Von Goethe, Itten, Belson, Fischinger, Lye and the ever immortal Paul Sharits and Harry Smith. Chromatic Frenzy creates, a colorful cauldron where primaries are mixed a cornucopia of suspended spectrums of light. Chromatic Frenzy delights the viewer with an alchemist’s view of suspended and refracted spectrums of light.  (KL)"
        },
        {
            "artist": "Simon Payne",
            "image": "http://dinca.org/wp-content/uploads/2013/11/Simon-Payne-Twice-Over.png",
            "title": "Twice Over",
            "videoinfo": "London, UK | 2012 | 12 min | video | color | sound",
            "homepage": "http://simonrpayne.co.ul",
            "description": "In Twice Over Simon Payne, has filmed off the screen, with a hand held camcorder, an original sequence of digitally generated coloured rectangles. The re-filmed layer and an original variation of it are then superimposed on themselves, so that the discrepancies between them generate a third element: differently coloured slender rectangles that judder between the main blocks of colour. In contrast to the many computer-generated works Payne has made over the last eight or so years, the texture and ‘noise’ of the analogue decay generated by re-filming (as opposed to digital copying) plays an important role. (Nicky Hamlyn)"
        },
        {
            "artist": "James Lowne",
            "image": "http://dinca.org/wp-content/uploads/2013/11/James-Lowne-Someone-Behind-The-Door-Knocks-At-Irregular-Intervals.jpg",
            "title": "Someone Behind The Door Knocks At Irregular Intervals",
            "videoinfo": "London, England | 2011 | 5 min | video | sound",
            "homepage": "http://jameslowne.com",
            "description": "Julia spends the day at the leisure centre where she slips into a sombre reverie. As her thoughts continue she becomes aware of the possibility that perhaps she never came here at all. Outside in the sun, the stillness changes the road, its inherent notion of speed has dissipated, allowing the surface to be felt.  (JL)"
        },
        {
            "artist": "Shana Moulton",
            "image": "http://dinca.org/wp-content/uploads/2013/11/Shana-Moulton-Swisspering.jpg",
            "title": "Swisspering",
            "videoinfo": "SF, CA | 2013 | 9 min | video | sound",
            "homepage": "http://shanamoulton.info",
            "description": "The video <em>Swisspering</em> (2013), is framed by the act of applying and removing makeup. As the makeup is removed with a product called Swisspers, the body is, in effect, carved away. Through this act, Moulton investigates Autonomous Sensory Meridian Response (ASMR), defined as the physical sensation of pleasurable tingling that begins on the scalp and moves throughout the body that is often triggered by whispering.  (SM)"
        }
    ]
}